module.exports = {
	config: {
		name: "murgi",
    aliases: ["Murgi"],
		version: "1.0",
		author: "Siam",
		role: 2,
		category: "funny",
    shortDescription: "murgi",
		longDescription: "",
		guide: {
			vi: "not Available",
			en: "{p} chik"
		} 
	},

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("আপনি যাকে চুদতে  চান এমন 1 জনকে @ম্যানশন করতে হবে", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("๛➣𓆩𝗦𝗜𝗔𝗠‣𒁍 এর চুদা লো");
setTimeout(() => {a({body: "খাংকির পোলা তর মারে চুদি 🥰" + " " + name, mentions: arraytag})}, 2000);
setTimeout(() => {a({body: "Welcome শুয়োরের বাচ্চা 🥰।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "𝗦𝗜𝗔𝗠 এর জারজ সন্তান" + " " + name, mentions: arraytag})}, 4000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম।😍." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "খাংকির পোলা তর কচি বোন রে চুদি 😍.." + " " + name, mentions: arraytag})}, 6000);
setTimeout(() => {a({body: "আমি তোর বাপ ๛➣𓆩𝗦𝗜𝗔𝗠‣𒁍 যেইখানে দেখবি সেইখানে দিবি সালাম🫡👹 🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "খাঙ্কিরপোলা পোলা তর বোনের  হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🥱" + " " + name, mentions: arraytag})}, 8000);
setTimeout(() => {a({body: "তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।🥱" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "Hi ๛➣𓆩𝗦𝗜𝗔𝗠‣𒁍 এর জারজ মাগির পোলা" + " " + name, mentions: arraytag})}, 10000);
setTimeout(() => {a({body: "খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু" + " " + name, mentions: arraytag})}, 11000);
setTimeout(() => {a({body: "খান্কি মাগির পোলা তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু🤫" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম 😹" + " " + name, mentions: arraytag})}, 13000);
setTimeout(() => {a({body: "খানকির পোলা তোর বাপ 𝗦𝗜𝗔𝗠,𝗠𝗨𝗡𝗡𝗔,𝗡𝗔𝗝𝗠𝗨𝗟,𝗥𝗔𝗧𝗨𝗟 এর কাছে খমা চা 🥱" + " " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: "জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাইয়া তোদের পিছন দিয়া ঢুকামু।🥱" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "DNA টেষ্ট করা দেখবি  ๛➣𓆩𝗦𝗜𝗔𝗠,𝗠𝗨𝗡𝗡𝗔,𝗡𝗔𝗝𝗠𝗨𝗟,𝗥𝗔𝗧𝗨𝗟 এর চুদা তেই তর জন্ম 🥱" + " " + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: "বস্তির ছেলে তর মায়ের ভুদাতে পোকা 🤮" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "~  ๛➣𓆩𝗠𝗨𝗡𝗡𝗔᭄𓆪‣𒁍এর ফাটা কন্ডমের ফসল। জা ভাগ🥱" + " " + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: "depression থেকেও তর মাইরে চু*** দি ☺" + " " + name, mentions: arraytag})}, 19000);
setTimeout(() => {a({body: "তর আম্মু রে পায়জামা খুলে চুদি 😹" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "খাঙ্কিরপোলা পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে👿" + " " + name, mentions: arraytag})}, 21000);
setTimeout(() => {a({body:"তর কচি বোন এর পম পম😍.."+ " " + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: "হিজলা মাগির পোলা✋" + " " + name, mentions: arraytag})}, 23000);
setTimeout(() => {a({body: "তোর আম্মুরে জিগাইস আব্বা কিডা 🥱" + " " + name, mentions: arraytag})}, 24000);
setTimeout(() => {a({body: "~ চুদা কি আরো খাবি মাগির পোলা 🥱" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body:"তোর আম্মুরে দিনে রাইতে চুদি খনিকের ছেলে"+ " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body:"তোর মার ধনে লাকি মলম লাগাই দিবো খানকির ছেলে 😹"+ " " + name, mentions: arraytag})}, 27000);
setTimeout(() => {a({body:"তোর মারে উলটো ঝুলিয়ে চুদি খানকির ছেলে"+ " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body:"তোর মাকে চুদতে জাইতেছি কিছু বলবিনাতো 🥱"+ " " + name, mentions: arraytag})}, 29000);
setTimeout(() => {a({body:"তোর মার গুদে রট ঢুকিয়ে চুদি 😹"+ " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body:"কাদিসনা তোর মাকে ওতোটাও চুদিনি just কন্ডম ছাড়া চুদলাম জাতে তোর মতো আরো আবালের জন্ম হয়"+ " " + name, mentions: arraytag})}, 31000);
setTimeout(() => {a({body:"আশা করি ভবিষ্যতে আর আমাদের সাথে লাগতে আসবিনা"+ " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body:"𝗠𝗨𝗡𝗡𝗔 এর কন্ডম না আনার ভুলে তোর জন্ম"+ " " + name, mentions: arraytag})}, 33000);
setTimeout(() => {a({body:"ছেরে দিলাম কারন তোর মতো অনেক আবাল কে এখনো চোদার বাকি 🥱"+ " " + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body:"তোর আব্বুদের কথা ভুলিস্না জেনো🥱"+ " " + name, mentions: arraytag})}, 35000);

setTimeout(() => {a({body: "রেন্ডি মাগীর পোলা তর মায়ের ভুদা কালা। 🤢🤮" + " " + name, mentions: arraytag})}, 2000);
	}
};
